// Class Work 4.09.2023 -------------------------------------------	

/// Паттерны проектирования

// SOLID / GRASP / GoF / Architecture


// Идиомы <---> Паттерны
/*
 
Идиомы - идеи решения конкретных задач в привязке к конкретному языку програмирования

Паттерны - обощенные идеи проектрования программ, не привязанные к ЯП

*/

// Структура паттерна
/*

1) Название
2) Решаемая проблема
3) Плюсы внедрения
4) Схема реализации

*/

// Применение паттернов






//Литература
/*
1. Швец. Введение в паттерны
*/

// MAIN ------- MAIN ------- MAIN ------- MAIN ------- MAIN --------
int main(){}


